app/controllers/auth_controller.rb

  def create
    @user = User.find_by(email: params[:email])
    #User#authenticate comes from BCrypt
    if @user && @user.authenticate(params[:password])
      # encode token comes from ApplicationController
      if @user.weather_forecasts.length<1 || ((((Time.now-@user.weather_forecasts.last.created_at.localtime)/60).to_i) > 480)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "not_nil"], ["LIMIT", 1]]
INSERT INTO "weather_forecasts" ("percip_probability", "percip_range", "temp_lo", "temp_hi", "avg_temp", "summary", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"