app/controllers/users_controller.rb

INSERT INTO "weather_forecasts" ("percip_probability", "temp_lo", "temp_hi", "avg_temp", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["percip_probability", 0.0], ["temp_lo", 59], ["temp_hi", 64], ["avg_temp", 62], ["user_id", 2], ["created_at", "2018-10-15 05:49:54.078540"], ["updated_at", "2018-10-15 05:49:54.078540"]]
INSERT INTO "users" ("first_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT  "weather_forecasts".* FROM "weather_forecasts" WHERE "weather_forecasts"."user_id" = $1 ORDER BY "weather_forecasts"."id" DESC LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
---
  def account
    if Time.at(Time.now - current_user.weather_forecasts.last.created_at).strftime("%M").to_i > 480

INSERT INTO "users" ("first_name", "last_name", "email", "dob", "zip_code", "password_digest", "gender", "weight", "temp_units", "temp_preference", "desired_temp", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
  def create
    @user = User.create(user_params)