app/models/user.rb

    @temp_avg = (@temps.reduce(0, :+)/@temps.length).round
    @precip_avg = ((@precips.reduce(0, :+)/@precips.length)*100).round
    @precips_summary=@precips_summary.join(", ")
    forecast= WeatherForecast.create(percip_probability:@precip_avg, temp_lo:@temp_lo, temp_hi:@temp_hi, avg_temp:@temp_avg, user:self, percip_range:@precips_summary, summary:@summary)
---
INSERT INTO "weather_forecasts" ("percip_probability", "percip_range", "temp_lo", "temp_hi", "avg_temp", "summary", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"