app/models/weather_forecast.rb

INSERT INTO "clothing_suggestions" ("weather_forecast_id", "item_1", "accessory_1", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["weather_forecast_id", 54], ["item_1", "t_shirt"], ["accessory_1", ""], ["created_at", "2018-10-18 21:07:48.297305"], ["updated_at", "2018-10-18 21:07:48.297305"]]
---
  def make_suggestion(summary)
    @string_of_accessories = self.make_precip_suggestion(summary).join(",")
    @string_of_items = self.make_temp_suggestion(summary, @string_of_accessories).join(",")
    # @string_of_accessories_1 = self.make_precip_suggestion(summary.first).join(",")
    # @string_of_items_1 = self.make_temp_suggestions(summary.first, @string_of_accessories_1).join(",")
    ClothingSuggestion.create(weather_forecast:self, item_1:@string_of_items, accessory_1:@string_of_accessories)